solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_PMC.h
/*! @name VERID - PMC Version and Feature ID */
/*! @{ */

#define PMC_VERID_FEATURE_MASK                   (0xFFFFU)
#define PMC_VERID_FEATURE_SHIFT                  (0U)
/*! FEATURE - Feature Identification Number */
#define PMC_VERID_FEATURE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_VERID_FEATURE_SHIFT)) & PMC_VERID_FEATURE_MASK)

#define PMC_VERID_MINOR_MASK                     (0xFF0000U)
#define PMC_VERID_MINOR_SHIFT                    (16U)
/*! MINOR - Minor Version Number */
#define PMC_VERID_MINOR(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_VERID_MINOR_SHIFT)) & PMC_VERID_MINOR_MASK)

#define PMC_VERID_MAJOR_MASK                     (0xFF000000U)
#define PMC_VERID_MAJOR_SHIFT                    (24U)
/*! MAJOR - Major Version Number */
#define PMC_VERID_MAJOR(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_VERID_MAJOR_SHIFT)) & PMC_VERID_MAJOR_MASK)
/*! @} */

/*! @name STATUS - PMC Status */
/*! @{ */

#define PMC_STATUS_BUSY_MASK                     (0x1U)
#define PMC_STATUS_BUSY_SHIFT                    (0U)
/*! BUSY - Finite State Machine Status
 *  0b0..PMC state machines are idle
 *  0b1..PMC state machine is busy
 */
#define PMC_STATUS_BUSY(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_BUSY_SHIFT)) & PMC_STATUS_BUSY_MASK)

#define PMC_STATUS_LVDVDD1_MASK                  (0x40000U)
#define PMC_STATUS_LVDVDD1_SHIFT                 (18U)
/*! LVDVDD1 - VDD1 Low-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_LVDVDD1(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_LVDVDD1_SHIFT)) & PMC_STATUS_LVDVDD1_MASK)

#define PMC_STATUS_LVDVDD2_MASK                  (0x80000U)
#define PMC_STATUS_LVDVDD2_SHIFT                 (19U)
/*! LVDVDD2 - VDD2 Low-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_LVDVDD2(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_LVDVDD2_SHIFT)) & PMC_STATUS_LVDVDD2_MASK)

#define PMC_STATUS_LVDVDDN_MASK                  (0x100000U)
#define PMC_STATUS_LVDVDDN_SHIFT                 (20U)
/*! LVDVDDN - VDDN Low-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_LVDVDDN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_LVDVDDN_SHIFT)) & PMC_STATUS_LVDVDDN_MASK)

#define PMC_STATUS_HVDVDD1_MASK                  (0x200000U)
#define PMC_STATUS_HVDVDD1_SHIFT                 (21U)
/*! HVDVDD1 - VDD1 High-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_HVDVDD1(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVDVDD1_SHIFT)) & PMC_STATUS_HVDVDD1_MASK)

#define PMC_STATUS_HVDVDD2_MASK                  (0x400000U)
#define PMC_STATUS_HVDVDD2_SHIFT                 (22U)
/*! HVDVDD2 - VDD2 High-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_HVDVDD2(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVDVDD2_SHIFT)) & PMC_STATUS_HVDVDD2_MASK)

#define PMC_STATUS_HVDVDDN_MASK                  (0x800000U)
#define PMC_STATUS_HVDVDDN_SHIFT                 (23U)
/*! HVDVDDN - VDDN High-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_HVDVDDN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVDVDDN_SHIFT)) & PMC_STATUS_HVDVDDN_MASK)

#define PMC_STATUS_HVD1V8_MASK                   (0x1000000U)
#define PMC_STATUS_HVD1V8_SHIFT                  (24U)
/*! HVD1V8 - VDD1V8 High-Voltage Detector
 *  0b0..Detector is not tripped
 *  0b1..Detector is tripped
 */
#define PMC_STATUS_HVD1V8(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_HVD1V8_SHIFT)) & PMC_STATUS_HVD1V8_MASK)

#define PMC_STATUS_RTCWKUP_MASK                  (0x2000000U)
#define PMC_STATUS_RTCWKUP_SHIFT                 (25U)
/*! RTCWKUP - RTC Wake-up
 *  0b0..Compute RTC wake-up is not active
 *  0b1..Compute RTC wake-up is asserted
 */
#define PMC_STATUS_RTCWKUP(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_RTCWKUP_SHIFT)) & PMC_STATUS_RTCWKUP_MASK)

#define PMC_STATUS_INTN_MASK                     (0x8000000U)
#define PMC_STATUS_INTN_SHIFT                    (27U)
/*! INTN - PMIC_IRQN Interrupt Input
 *  0b0..Negated. Pin is high
 *  0b1..Asserted. Pin is low
 */
#define PMC_STATUS_INTN(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_INTN_SHIFT)) & PMC_STATUS_INTN_MASK)

#define PMC_STATUS_DSSENS_MASK                   (0x20000000U)
#define PMC_STATUS_DSSENS_SHIFT                  (29U)
/*! DSSENS - CPU1 Deep Sleep
 *  0b0..CPU1 is in Active mode
 *  0b1..CPU1 is in Deep Sleep mode
 */
#define PMC_STATUS_DSSENS(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_DSSENS_SHIFT)) & PMC_STATUS_DSSENS_MASK)

#define PMC_STATUS_DSCOMP_MASK                   (0x40000000U)
#define PMC_STATUS_DSCOMP_SHIFT                  (30U)
/*! DSCOMP - CPU0 Deep Sleep
 *  0b0..CPU0 is in Active mode
 *  0b1..CPU0 is in Deep Sleep mode
 */
#define PMC_STATUS_DSCOMP(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_DSCOMP_SHIFT)) & PMC_STATUS_DSCOMP_MASK)
/*! @} */

/*! @name FLAGS - PMC Flags in Compute Domain */
/*! @{ */

#define PMC_FLAGS_DSALLF_MASK                    (0x1U)
#define PMC_FLAGS_DSALLF_SHIFT                   (0U)
/*! DSALLF - Deep Sleep Flag
 *  0b0..CPU0 and CPU1 are not in Deep Sleep mode at the same time
 *  0b1..CPU0 and CPU1 have both been in Deep Sleep mode at the same time
 */
#define PMC_FLAGS_DSALLF(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DSALLF_SHIFT)) & PMC_FLAGS_DSALLF_MASK)

#define PMC_FLAGS_ITRCRF_MASK                    (0x2U)
#define PMC_FLAGS_ITRCRF_SHIFT                   (1U)
/*! ITRCRF - ITRC RAM ZEROIZE Flag
 *  0b0..Not detected
 *  0b1..ITRC RAM ZEROIZE detected
 */
#define PMC_FLAGS_ITRCRF(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_ITRCRF_SHIFT)) & PMC_FLAGS_ITRCRF_MASK)

#define PMC_FLAGS_BBSR1EF_MASK                   (0x4U)
#define PMC_FLAGS_BBSR1EF_SHIFT                  (2U)
/*! BBSR1EF - VDD1 SRAM Body Bias Error Flag
 *  0b0..No SRAM body bias error
 *  0b1..SRAM body bias error detected
 */
#define PMC_FLAGS_BBSR1EF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_BBSR1EF_SHIFT)) & PMC_FLAGS_BBSR1EF_MASK)

#define PMC_FLAGS_BBSR2EF_MASK                   (0x8U)
#define PMC_FLAGS_BBSR2EF_SHIFT                  (3U)
/*! BBSR2EF - VDD2 SRAM Body Bias Error Flag
 *  0b0..No SRAM body bias error
 *  0b1..SRAM body bias error detected
 */
#define PMC_FLAGS_BBSR2EF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_BBSR2EF_SHIFT)) & PMC_FLAGS_BBSR2EF_MASK)

#define PMC_FLAGS_BB1EF_MASK                     (0x10U)
#define PMC_FLAGS_BB1EF_SHIFT                    (4U)
/*! BB1EF - VDD1 Body Bias Error Flag
 *  0b0..No body bias error
 *  0b1..Body bias error detected
 */
#define PMC_FLAGS_BB1EF(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_BB1EF_SHIFT)) & PMC_FLAGS_BB1EF_MASK)

#define PMC_FLAGS_BB2EF_MASK                     (0x20U)
#define PMC_FLAGS_BB2EF_SHIFT                    (5U)
/*! BB2EF - VDD2 Body Bias Error Flag
 *  0b0..No body bias error
 *  0b1..Body bias error detected
 */
#define PMC_FLAGS_BB2EF(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_BB2EF_SHIFT)) & PMC_FLAGS_BB2EF_MASK)

#define PMC_FLAGS_BBNEF_MASK                     (0x40U)
#define PMC_FLAGS_BBNEF_SHIFT                    (6U)
/*! BBNEF - VDDN Body Bias Error Flag
 *  0b0..No body bias error
 *  0b1..Body bias error detected
 */
#define PMC_FLAGS_BBNEF(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_BBNEF_SHIFT)) & PMC_FLAGS_BBNEF_MASK)

#define PMC_FLAGS_SCP1OCF_MASK                   (0x80U)
#define PMC_FLAGS_SCP1OCF_SHIFT                  (7U)
/*! SCP1OCF - SCPC VDD1 Overcurrent Flag
 *  0b0..No overcurrent event detected
 *  0b1..Overcurrent event detected
 */
#define PMC_FLAGS_SCP1OCF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_SCP1OCF_SHIFT)) & PMC_FLAGS_SCP1OCF_MASK)

#define PMC_FLAGS_SCP2OCF_MASK                   (0x100U)
#define PMC_FLAGS_SCP2OCF_SHIFT                  (8U)
/*! SCP2OCF - SCPC VDD2 Overcurrent Flag
 *  0b0..No overcurrent event detected
 *  0b1..Overcurrent event detected
 */
#define PMC_FLAGS_SCP2OCF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_SCP2OCF_SHIFT)) & PMC_FLAGS_SCP2OCF_MASK)

#define PMC_FLAGS_DCHPOCF_MASK                   (0x200U)
#define PMC_FLAGS_DCHPOCF_SHIFT                  (9U)
/*! DCHPOCF - DCDC High-Power Mode Overcurrent Flag
 *  0b0..No overcurrent event detected
 *  0b1..Overcurrent event detected
 */
#define PMC_FLAGS_DCHPOCF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DCHPOCF_SHIFT)) & PMC_FLAGS_DCHPOCF_MASK)

#define PMC_FLAGS_DCLPOCF_MASK                   (0x400U)
#define PMC_FLAGS_DCLPOCF_SHIFT                  (10U)
/*! DCLPOCF - DCDC Low-Power Mode Overcurrent Flag
 *  0b0..No overcurrent event detected
 *  0b1..Overcurrent event detected
 */
#define PMC_FLAGS_DCLPOCF(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FLAGS_DCLPOCF_SHIFT)) & PMC_FLAGS_DCLPOCF_MASK)

