solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_PMC.h
#define PMC_PDRUNCFG0_AFBB2_PD_MASK              (0x2000000U)
#define PMC_PDRUNCFG0_AFBB2_PD_SHIFT             (25U)
/*! AFBB2_PD - Power Down AFBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_AFBB2_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBB2_PD_SHIFT)) & PMC_PDRUNCFG0_AFBB2_PD_MASK)

#define PMC_PDRUNCFG0_RBBN_PD_MASK               (0x4000000U)
#define PMC_PDRUNCFG0_RBBN_PD_SHIFT              (26U)
/*! RBBN_PD - Power Down RBB in VDDN Domain
 *  0b0..If PDRUNCFG0[AFBBN_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBN_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBN_PD_SHIFT)) & PMC_PDRUNCFG0_RBBN_PD_MASK)

#define PMC_PDRUNCFG0_AFBBN_PD_MASK              (0x8000000U)
#define PMC_PDRUNCFG0_AFBBN_PD_SHIFT             (27U)
/*! AFBBN_PD - Power Down AFBB in VDDN Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_AFBBN_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBBN_PD_SHIFT)) & PMC_PDRUNCFG0_AFBBN_PD_MASK)

#define PMC_PDRUNCFG0_RBBSR1_PD_MASK             (0x10000000U)
#define PMC_PDRUNCFG0_RBBSR1_PD_SHIFT            (28U)
/*! RBBSR1_PD - Power Down SRAM RBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBSR1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBSR1_PD_SHIFT)) & PMC_PDRUNCFG0_RBBSR1_PD_MASK)

#define PMC_PDRUNCFG0_RBBSR2_PD_MASK             (0x20000000U)
#define PMC_PDRUNCFG0_RBBSR2_PD_SHIFT            (29U)
/*! RBBSR2_PD - Power Down SRAM RBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBSR2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBSR2_PD_SHIFT)) & PMC_PDRUNCFG0_RBBSR2_PD_MASK)
/*! @} */

/*! @name PDRUNCFG1 - PD Run Configuration 1 in Compute Domain */
/*! @{ */

#define PMC_PDRUNCFG1_TEMP_PD_MASK               (0x1U)
#define PMC_PDRUNCFG1_TEMP_PD_SHIFT              (0U)
/*! TEMP_PD - Power Down PMC Temperature Sensor
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_TEMP_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_TEMP_PD_SHIFT)) & PMC_PDRUNCFG1_TEMP_PD_MASK)

#define PMC_PDRUNCFG1_PMCREF_LP_MASK             (0x2U)
#define PMC_PDRUNCFG1_PMCREF_LP_SHIFT            (1U)
/*! PMCREF_LP - PMC References in Low-Power Mode
 *  0b0..Sets PMC references in high-power mode
 *  0b1..Sets PMC references in low-power mode if not overridden by any *_PD bits
 */
#define PMC_PDRUNCFG1_PMCREF_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PMCREF_LP_SHIFT)) & PMC_PDRUNCFG1_PMCREF_LP_MASK)

#define PMC_PDRUNCFG1_HVD1V8_PD_MASK             (0x4U)
#define PMC_PDRUNCFG1_HVD1V8_PD_SHIFT            (2U)
/*! HVD1V8_PD - HVD Power Down
 *  0b0..Power on. In this case, PMC references will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_HVD1V8_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_HVD1V8_PD_SHIFT)) & PMC_PDRUNCFG1_HVD1V8_PD_MASK)

#define PMC_PDRUNCFG1_POR1_LP_MASK               (0x8U)
#define PMC_PDRUNCFG1_POR1_LP_SHIFT              (3U)
/*! POR1_LP - POR Low-Power Mode in VDD1 Domain
 *  0b0..Sets POR in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets POR in low-power mode
 */
#define PMC_PDRUNCFG1_POR1_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_POR1_LP_SHIFT)) & PMC_PDRUNCFG1_POR1_LP_MASK)

#define PMC_PDRUNCFG1_LVD1_LP_MASK               (0x10U)
#define PMC_PDRUNCFG1_LVD1_LP_SHIFT              (4U)
/*! LVD1_LP - LVD Low-Power Mode in VDD1 Domain
 *  0b0..Sets LVD in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets LVD in low-power mode
 */
#define PMC_PDRUNCFG1_LVD1_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_LVD1_LP_SHIFT)) & PMC_PDRUNCFG1_LVD1_LP_MASK)

#define PMC_PDRUNCFG1_HVD1_PD_MASK               (0x20U)
#define PMC_PDRUNCFG1_HVD1_PD_SHIFT              (5U)
/*! HVD1_PD - Power Down HVD in VDD1 Domain
 *  0b0..Power on. In this case, PMC references will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_HVD1_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_HVD1_PD_SHIFT)) & PMC_PDRUNCFG1_HVD1_PD_MASK)

#define PMC_PDRUNCFG1_AGDET1_PD_MASK             (0x40U)
#define PMC_PDRUNCFG1_AGDET1_PD_SHIFT            (6U)
/*! AGDET1_PD - Power Down aGDET in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_AGDET1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_AGDET1_PD_SHIFT)) & PMC_PDRUNCFG1_AGDET1_PD_MASK)

#define PMC_PDRUNCFG1_POR2_LP_MASK               (0x80U)
#define PMC_PDRUNCFG1_POR2_LP_SHIFT              (7U)
/*! POR2_LP - POR Low-Power Mode in VDD2 Domain
 *  0b0..Sets POR in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets POR in low-power mode
 */
#define PMC_PDRUNCFG1_POR2_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_POR2_LP_SHIFT)) & PMC_PDRUNCFG1_POR2_LP_MASK)

#define PMC_PDRUNCFG1_LVD2_LP_MASK               (0x100U)
#define PMC_PDRUNCFG1_LVD2_LP_SHIFT              (8U)
/*! LVD2_LP - LVD Low-Power Mode in VDD2 Domain
 *  0b0..Sets LVD in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets LVD in low-power mode
 */
#define PMC_PDRUNCFG1_LVD2_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_LVD2_LP_SHIFT)) & PMC_PDRUNCFG1_LVD2_LP_MASK)

#define PMC_PDRUNCFG1_HVD2_PD_MASK               (0x200U)
#define PMC_PDRUNCFG1_HVD2_PD_SHIFT              (9U)
/*! HVD2_PD - Power Down HVD in VDD2 Domain
 *  0b0..Power on. In this case, PMC references will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_HVD2_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_HVD2_PD_SHIFT)) & PMC_PDRUNCFG1_HVD2_PD_MASK)

#define PMC_PDRUNCFG1_AGDET2_PD_MASK             (0x400U)
#define PMC_PDRUNCFG1_AGDET2_PD_SHIFT            (10U)
/*! AGDET2_PD - Power Down aGDET in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_AGDET2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_AGDET2_PD_SHIFT)) & PMC_PDRUNCFG1_AGDET2_PD_MASK)

#define PMC_PDRUNCFG1_PORN_LP_MASK               (0x800U)
#define PMC_PDRUNCFG1_PORN_LP_SHIFT              (11U)
/*! PORN_LP - POR Low-Power Mode in VDDN Domain
 *  0b0..Sets POR in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets POR in low-power mode
 */
#define PMC_PDRUNCFG1_PORN_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PORN_LP_SHIFT)) & PMC_PDRUNCFG1_PORN_LP_MASK)

#define PMC_PDRUNCFG1_LVDN_LP_MASK               (0x1000U)
#define PMC_PDRUNCFG1_LVDN_LP_SHIFT              (12U)
/*! LVDN_LP - LVD Low-Power Mode in VDDN Domain
 *  0b0..Sets LVD in high-power mode. In this case, PMC references will be in high-power mode
 *  0b1..Sets LVD in low-power mode
 */
#define PMC_PDRUNCFG1_LVDN_LP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_LVDN_LP_SHIFT)) & PMC_PDRUNCFG1_LVDN_LP_MASK)

#define PMC_PDRUNCFG1_HVDN_PD_MASK               (0x2000U)
#define PMC_PDRUNCFG1_HVDN_PD_SHIFT              (13U)
/*! HVDN_PD - Power Down HVD in VDDN Domain
 *  0b0..Power on. In this case, PMC references will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_HVDN_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_HVDN_PD_SHIFT)) & PMC_PDRUNCFG1_HVDN_PD_MASK)

#define PMC_PDRUNCFG1_OTP_PD_MASK                (0x8000U)
#define PMC_PDRUNCFG1_OTP_PD_SHIFT               (15U)
/*! OTP_PD - Power Down OTP
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_OTP_PD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_OTP_PD_SHIFT)) & PMC_PDRUNCFG1_OTP_PD_MASK)

#define PMC_PDRUNCFG1_ROM_PD_MASK                (0x10000U)
#define PMC_PDRUNCFG1_ROM_PD_SHIFT               (16U)
/*! ROM_PD - Power Down ROM
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_ROM_PD(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_ROM_PD_SHIFT)) & PMC_PDRUNCFG1_ROM_PD_MASK)
/*! @} */

/*! @name PDRUNCFG2 - PD Run Configuration 2 in Compute Domain */
/*! @{ */

#define PMC_PDRUNCFG2_SRAM0_MASK                 (0x1U)
#define PMC_PDRUNCFG2_SRAM0_SHIFT                (0U)
/*! SRAM0 - Power Down RAM Partition 0 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM0(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM0_SHIFT)) & PMC_PDRUNCFG2_SRAM0_MASK)

#define PMC_PDRUNCFG2_SRAM1_MASK                 (0x2U)
#define PMC_PDRUNCFG2_SRAM1_SHIFT                (1U)
/*! SRAM1 - Power Down RAM Partition 1 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM1(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM1_SHIFT)) & PMC_PDRUNCFG2_SRAM1_MASK)

#define PMC_PDRUNCFG2_SRAM2_MASK                 (0x4U)
#define PMC_PDRUNCFG2_SRAM2_SHIFT                (2U)
/*! SRAM2 - Power Down RAM Partition 2 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM2(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM2_SHIFT)) & PMC_PDRUNCFG2_SRAM2_MASK)

#define PMC_PDRUNCFG2_SRAM3_MASK                 (0x8U)
#define PMC_PDRUNCFG2_SRAM3_SHIFT                (3U)
/*! SRAM3 - Power Down RAM Partition 3 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM3(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM3_SHIFT)) & PMC_PDRUNCFG2_SRAM3_MASK)

