solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_PMC.h
#define PMC_PDSLEEPCFG0_V2COMP_DSR_MASK          (0x20U)
#define PMC_PDSLEEPCFG0_V2COMP_DSR_SHIFT         (5U)
/*! V2COMP_DSR - Power Switch and DSR Enable in VDD2_COMP Domain
 *  0b0..Powers on VDD2_COMP
 *  0b1..Enables DSR mode in VDD2_COMP
 */
#define PMC_PDSLEEPCFG0_V2COMP_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2COMP_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2COMP_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2NMED_DSR_MASK          (0x40U)
#define PMC_PDSLEEPCFG0_V2NMED_DSR_SHIFT         (6U)
/*! V2NMED_DSR - Power Switch and DSR Enable in VDD2_MEDIA and VDDN_MEDIA Domains
 *  0b0..Powers on VDD2_MEDIA and VDDN_MEDIA
 *  0b1..Enables DSR mode in VDD2_MEDIA and VDDN_MEDIA
 */
#define PMC_PDSLEEPCFG0_V2NMED_DSR(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2NMED_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2NMED_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2COM_DSR_MASK           (0x80U)
#define PMC_PDSLEEPCFG0_V2COM_DSR_SHIFT          (7U)
/*! V2COM_DSR - Power Switch and DSR Enable in VDD2_COM Domain
 *  0b0..Powers on VDD2_COM
 *  0b1..Enables DSR mode in VDD2_COM
 */
#define PMC_PDSLEEPCFG0_V2COM_DSR(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2COM_DSR_SHIFT)) & PMC_PDSLEEPCFG0_V2COM_DSR_MASK)

#define PMC_PDSLEEPCFG0_VNCOM_DSR_MASK           (0x100U)
#define PMC_PDSLEEPCFG0_VNCOM_DSR_SHIFT          (8U)
/*! VNCOM_DSR - Power Switch and DSR Enable in VDDN_COM Domain
 *  0b0..Powers on VDDN_COM
 *  0b1..Enables DSR mode in VDDN_COM
 */
#define PMC_PDSLEEPCFG0_VNCOM_DSR(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_VNCOM_DSR_SHIFT)) & PMC_PDSLEEPCFG0_VNCOM_DSR_MASK)

#define PMC_PDSLEEPCFG0_V2DSP_PD_MASK            (0x200U)
#define PMC_PDSLEEPCFG0_V2DSP_PD_SHIFT           (9U)
/*! V2DSP_PD - Power Down VDD2_DSP
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_V2DSP_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2DSP_PD_SHIFT)) & PMC_PDSLEEPCFG0_V2DSP_PD_MASK)

#define PMC_PDSLEEPCFG0_V2MIPI_PD_MASK           (0x400U)
#define PMC_PDSLEEPCFG0_V2MIPI_PD_SHIFT          (10U)
/*! V2MIPI_PD - Power Down MIPI PHY in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_V2MIPI_PD(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_V2MIPI_PD_SHIFT)) & PMC_PDSLEEPCFG0_V2MIPI_PD_MASK)

#define PMC_PDSLEEPCFG0_DCDC_LP_MASK             (0x1000U)
#define PMC_PDSLEEPCFG0_DCDC_LP_SHIFT            (12U)
/*! DCDC_LP - DCDC Low-Power Mode
 *  0b0..Enables DCDC in high-power mode
 *  0b1..Enables DCDC in low-power mode
 */
#define PMC_PDSLEEPCFG0_DCDC_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_DCDC_LP_SHIFT)) & PMC_PDSLEEPCFG0_DCDC_LP_MASK)

#define PMC_PDSLEEPCFG0_DCDC_VSEL_MASK           (0x2000U)
#define PMC_PDSLEEPCFG0_DCDC_VSEL_SHIFT          (13U)
/*! DCDC_VSEL - DCDC Voltage Select
 *  0b0..Selects DCDCVSEL[VSEL0] level
 *  0b1..Selects DCDCVSEL[VSEL1] level
 */
#define PMC_PDSLEEPCFG0_DCDC_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_DCDC_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_DCDC_VSEL_MASK)

#define PMC_PDSLEEPCFG0_LDO1_MODE_MASK           (0xC000U)
#define PMC_PDSLEEPCFG0_LDO1_MODE_SHIFT          (14U)
/*! LDO1_MODE - LDO VDD1 Regulator Mode
 *  0b00..Bypass mode
 *  0b01..High-power mode
 *  0b10, 0b11..Low-power mode
 */
#define PMC_PDSLEEPCFG0_LDO1_MODE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO1_MODE_SHIFT)) & PMC_PDSLEEPCFG0_LDO1_MODE_MASK)

#define PMC_PDSLEEPCFG0_LDO1_VSEL_MASK           (0x30000U)
#define PMC_PDSLEEPCFG0_LDO1_VSEL_SHIFT          (16U)
/*! LDO1_VSEL - LDO VDD1 Voltage Select
 *  0b00..Selects LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level
 *  0b01..Selects LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level
 *  0b10..Selects LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level
 *  0b11..Selects LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level
 */
#define PMC_PDSLEEPCFG0_LDO1_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO1_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_LDO1_VSEL_MASK)

#define PMC_PDSLEEPCFG0_LDO2_MODE_MASK           (0xC0000U)
#define PMC_PDSLEEPCFG0_LDO2_MODE_SHIFT          (18U)
/*! LDO2_MODE - LDO VDD2 Regulator Mode
 *  0b00..Bypass mode
 *  0b01..High-power mode
 *  0b10, 0b11..Low-power mode
 */
#define PMC_PDSLEEPCFG0_LDO2_MODE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO2_MODE_SHIFT)) & PMC_PDSLEEPCFG0_LDO2_MODE_MASK)

#define PMC_PDSLEEPCFG0_LDO2_VSEL_MASK           (0x300000U)
#define PMC_PDSLEEPCFG0_LDO2_VSEL_SHIFT          (20U)
/*! LDO2_VSEL - LDO VDD2 Voltage Select
 *  0b00..Selects LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level
 *  0b01..Selects LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level
 *  0b10..Selects LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level
 *  0b11..Selects LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level
 */
#define PMC_PDSLEEPCFG0_LDO2_VSEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_LDO2_VSEL_SHIFT)) & PMC_PDSLEEPCFG0_LDO2_VSEL_MASK)

#define PMC_PDSLEEPCFG0_RBB1_PD_MASK             (0x400000U)
#define PMC_PDSLEEPCFG0_RBB1_PD_SHIFT            (22U)
/*! RBB1_PD - Power Down RBB in VDD1 Domain
 *  0b0..If PDSLEEPCFG0[AFBB1_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBB1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBB1_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBB1_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBB1_PD_MASK            (0x800000U)
#define PMC_PDSLEEPCFG0_AFBB1_PD_SHIFT           (23U)
/*! AFBB1_PD - Power Down AFBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_AFBB1_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBB1_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBB1_PD_MASK)

#define PMC_PDSLEEPCFG0_RBB2_PD_MASK             (0x1000000U)
#define PMC_PDSLEEPCFG0_RBB2_PD_SHIFT            (24U)
/*! RBB2_PD - Power Down RBB in VDD2 Domain
 *  0b0..If PDSLEEPCFG0[AFBB2_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBB2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBB2_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBB2_PD_MASK)

#define PMC_PDSLEEPCFG0_AFBB2_PD_MASK            (0x2000000U)
#define PMC_PDSLEEPCFG0_AFBB2_PD_SHIFT           (25U)
/*! AFBB2_PD - Power Down AFBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_AFBB2_PD(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_AFBB2_PD_SHIFT)) & PMC_PDSLEEPCFG0_AFBB2_PD_MASK)

#define PMC_PDSLEEPCFG0_RBBN_PD_MASK             (0x4000000U)
#define PMC_PDSLEEPCFG0_RBBN_PD_SHIFT            (26U)
/*! RBBN_PD - Power Down RBB in VDDN Domain
 *  0b0..If PDSLEEPCFG0[AFBBN_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG0_RBBN_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_RBBN_PD_SHIFT)) & PMC_PDSLEEPCFG0_RBBN_PD_MASK)

