solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_PMC.h
#define PMC_PDSLEEPCFG2_SRAM2_MASK               (0x4U)
#define PMC_PDSLEEPCFG2_SRAM2_SHIFT              (2U)
/*! SRAM2 - RAM Partition 2 Array Power Down
 *  0b0..Powers on RAM Partition 2 array
 *  0b1..Powers down RAM Partition 2 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM2(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM2_SHIFT)) & PMC_PDSLEEPCFG2_SRAM2_MASK)

#define PMC_PDSLEEPCFG2_SRAM3_MASK               (0x8U)
#define PMC_PDSLEEPCFG2_SRAM3_SHIFT              (3U)
/*! SRAM3 - RAM Partition 3 Array Power Down
 *  0b0..Powers on RAM Partition 3 array
 *  0b1..Powers down RAM Partition 3 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM3(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM3_SHIFT)) & PMC_PDSLEEPCFG2_SRAM3_MASK)

#define PMC_PDSLEEPCFG2_SRAM4_MASK               (0x10U)
#define PMC_PDSLEEPCFG2_SRAM4_SHIFT              (4U)
/*! SRAM4 - RAM Partition 4 Array Power Down
 *  0b0..Powers on RAM Partition 4 array
 *  0b1..Powers down RAM Partition 4 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM4(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM4_SHIFT)) & PMC_PDSLEEPCFG2_SRAM4_MASK)

#define PMC_PDSLEEPCFG2_SRAM5_MASK               (0x20U)
#define PMC_PDSLEEPCFG2_SRAM5_SHIFT              (5U)
/*! SRAM5 - RAM Partition 5 Array Power Down
 *  0b0..Powers on RAM Partition 5 array
 *  0b1..Powers down RAM Partition 5 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM5(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM5_SHIFT)) & PMC_PDSLEEPCFG2_SRAM5_MASK)

#define PMC_PDSLEEPCFG2_SRAM6_MASK               (0x40U)
#define PMC_PDSLEEPCFG2_SRAM6_SHIFT              (6U)
/*! SRAM6 - RAM Partition 6 Array Power Down
 *  0b0..Powers on RAM Partition 6 array
 *  0b1..Powers down RAM Partition 6 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM6(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM6_SHIFT)) & PMC_PDSLEEPCFG2_SRAM6_MASK)

#define PMC_PDSLEEPCFG2_SRAM7_MASK               (0x80U)
#define PMC_PDSLEEPCFG2_SRAM7_SHIFT              (7U)
/*! SRAM7 - RAM Partition 7 Array Power Down
 *  0b0..Powers on RAM Partition 7 array
 *  0b1..Powers down RAM Partition 7 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM7(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM7_SHIFT)) & PMC_PDSLEEPCFG2_SRAM7_MASK)

#define PMC_PDSLEEPCFG2_SRAM8_MASK               (0x100U)
#define PMC_PDSLEEPCFG2_SRAM8_SHIFT              (8U)
/*! SRAM8 - RAM Partition 8 Array Power Down
 *  0b0..Powers on RAM Partition 8 array
 *  0b1..Powers down RAM Partition 8 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM8(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM8_SHIFT)) & PMC_PDSLEEPCFG2_SRAM8_MASK)

#define PMC_PDSLEEPCFG2_SRAM9_MASK               (0x200U)
#define PMC_PDSLEEPCFG2_SRAM9_SHIFT              (9U)
/*! SRAM9 - RAM Partition 9 Array Power Down
 *  0b0..Powers on RAM Partition 9 array
 *  0b1..Powers down RAM Partition 9 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM9(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM9_SHIFT)) & PMC_PDSLEEPCFG2_SRAM9_MASK)

#define PMC_PDSLEEPCFG2_SRAM10_MASK              (0x400U)
#define PMC_PDSLEEPCFG2_SRAM10_SHIFT             (10U)
/*! SRAM10 - RAM Partition 10 Array Power Down
 *  0b0..Powers on RAM Partition 10 array
 *  0b1..Powers down RAM Partition 10 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM10(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM10_SHIFT)) & PMC_PDSLEEPCFG2_SRAM10_MASK)

#define PMC_PDSLEEPCFG2_SRAM11_MASK              (0x800U)
#define PMC_PDSLEEPCFG2_SRAM11_SHIFT             (11U)
/*! SRAM11 - RAM Partition 11 Array Power Down
 *  0b0..Powers on RAM Partition 11 array
 *  0b1..Powers down RAM Partition 11 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM11(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM11_SHIFT)) & PMC_PDSLEEPCFG2_SRAM11_MASK)

#define PMC_PDSLEEPCFG2_SRAM12_MASK              (0x1000U)
#define PMC_PDSLEEPCFG2_SRAM12_SHIFT             (12U)
/*! SRAM12 - RAM Partition 12 Array Power Down
 *  0b0..Powers on RAM Partition 12 array
 *  0b1..Powers down RAM Partition 12 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM12(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM12_SHIFT)) & PMC_PDSLEEPCFG2_SRAM12_MASK)

#define PMC_PDSLEEPCFG2_SRAM13_MASK              (0x2000U)
#define PMC_PDSLEEPCFG2_SRAM13_SHIFT             (13U)
/*! SRAM13 - RAM Partition 13 Array Power Down
 *  0b0..Powers on RAM Partition 13 array
 *  0b1..Powers down RAM Partition 13 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM13(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM13_SHIFT)) & PMC_PDSLEEPCFG2_SRAM13_MASK)

#define PMC_PDSLEEPCFG2_SRAM14_MASK              (0x4000U)
#define PMC_PDSLEEPCFG2_SRAM14_SHIFT             (14U)
/*! SRAM14 - RAM Partition 14 Array Power Down
 *  0b0..Powers on RAM Partition 14 array
 *  0b1..Powers down RAM Partition 14 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM14(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM14_SHIFT)) & PMC_PDSLEEPCFG2_SRAM14_MASK)

#define PMC_PDSLEEPCFG2_SRAM15_MASK              (0x8000U)
#define PMC_PDSLEEPCFG2_SRAM15_SHIFT             (15U)
/*! SRAM15 - RAM Partition 15 Array Power Down
 *  0b0..Powers on RAM Partition 15 array
 *  0b1..Powers down RAM Partition 15 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM15(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM15_SHIFT)) & PMC_PDSLEEPCFG2_SRAM15_MASK)

#define PMC_PDSLEEPCFG2_SRAM16_MASK              (0x10000U)
#define PMC_PDSLEEPCFG2_SRAM16_SHIFT             (16U)
/*! SRAM16 - RAM Partition 16 Array Power Down
 *  0b0..Powers on RAM Partition 16 array
 *  0b1..Powers down RAM Partition 16 array and periphery
 */
#define PMC_PDSLEEPCFG2_SRAM16(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG2_SRAM16_SHIFT)) & PMC_PDSLEEPCFG2_SRAM16_MASK)

