solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_PMC.h
#define PMC_PDCFGSTATUS2_SRAM6_MASK              (0x40U)
#define PMC_PDCFGSTATUS2_SRAM6_SHIFT             (6U)
/*! SRAM6 - RAM Partition 6 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM6(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM6_SHIFT)) & PMC_PDCFGSTATUS2_SRAM6_MASK)

#define PMC_PDCFGSTATUS2_SRAM7_MASK              (0x80U)
#define PMC_PDCFGSTATUS2_SRAM7_SHIFT             (7U)
/*! SRAM7 - RAM Partition 7 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM7(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM7_SHIFT)) & PMC_PDCFGSTATUS2_SRAM7_MASK)

#define PMC_PDCFGSTATUS2_SRAM8_MASK              (0x100U)
#define PMC_PDCFGSTATUS2_SRAM8_SHIFT             (8U)
/*! SRAM8 - RAM Partition 8 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM8(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM8_SHIFT)) & PMC_PDCFGSTATUS2_SRAM8_MASK)

#define PMC_PDCFGSTATUS2_SRAM9_MASK              (0x200U)
#define PMC_PDCFGSTATUS2_SRAM9_SHIFT             (9U)
/*! SRAM9 - RAM Partition 9 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM9(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM9_SHIFT)) & PMC_PDCFGSTATUS2_SRAM9_MASK)

#define PMC_PDCFGSTATUS2_SRAM10_MASK             (0x400U)
#define PMC_PDCFGSTATUS2_SRAM10_SHIFT            (10U)
/*! SRAM10 - RAM Partition 10 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM10(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM10_SHIFT)) & PMC_PDCFGSTATUS2_SRAM10_MASK)

#define PMC_PDCFGSTATUS2_SRAM11_MASK             (0x800U)
#define PMC_PDCFGSTATUS2_SRAM11_SHIFT            (11U)
/*! SRAM11 - RAM Partition 11 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM11(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM11_SHIFT)) & PMC_PDCFGSTATUS2_SRAM11_MASK)

#define PMC_PDCFGSTATUS2_SRAM12_MASK             (0x1000U)
#define PMC_PDCFGSTATUS2_SRAM12_SHIFT            (12U)
/*! SRAM12 - RAM Partition 12 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM12(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM12_SHIFT)) & PMC_PDCFGSTATUS2_SRAM12_MASK)

#define PMC_PDCFGSTATUS2_SRAM13_MASK             (0x2000U)
#define PMC_PDCFGSTATUS2_SRAM13_SHIFT            (13U)
/*! SRAM13 - RAM Partition 13 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM13(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM13_SHIFT)) & PMC_PDCFGSTATUS2_SRAM13_MASK)

#define PMC_PDCFGSTATUS2_SRAM14_MASK             (0x4000U)
#define PMC_PDCFGSTATUS2_SRAM14_SHIFT            (14U)
/*! SRAM14 - RAM Partition 14 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM14(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM14_SHIFT)) & PMC_PDCFGSTATUS2_SRAM14_MASK)

#define PMC_PDCFGSTATUS2_SRAM15_MASK             (0x8000U)
#define PMC_PDCFGSTATUS2_SRAM15_SHIFT            (15U)
/*! SRAM15 - RAM Partition 15 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM15(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM15_SHIFT)) & PMC_PDCFGSTATUS2_SRAM15_MASK)

#define PMC_PDCFGSTATUS2_SRAM16_MASK             (0x10000U)
#define PMC_PDCFGSTATUS2_SRAM16_SHIFT            (16U)
/*! SRAM16 - RAM Partition 16 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM16(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM16_SHIFT)) & PMC_PDCFGSTATUS2_SRAM16_MASK)

#define PMC_PDCFGSTATUS2_SRAM17_MASK             (0x20000U)
#define PMC_PDCFGSTATUS2_SRAM17_SHIFT            (17U)
/*! SRAM17 - RAM Partition 17 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM17(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM17_SHIFT)) & PMC_PDCFGSTATUS2_SRAM17_MASK)

#define PMC_PDCFGSTATUS2_SRAM18_MASK             (0x40000U)
#define PMC_PDCFGSTATUS2_SRAM18_SHIFT            (18U)
/*! SRAM18 - RAM Partition 18 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM18(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM18_SHIFT)) & PMC_PDCFGSTATUS2_SRAM18_MASK)

#define PMC_PDCFGSTATUS2_SRAM19_MASK             (0x80000U)
#define PMC_PDCFGSTATUS2_SRAM19_SHIFT            (19U)
/*! SRAM19 - RAM Partition 19 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM19(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM19_SHIFT)) & PMC_PDCFGSTATUS2_SRAM19_MASK)

#define PMC_PDCFGSTATUS2_SRAM20_MASK             (0x100000U)
#define PMC_PDCFGSTATUS2_SRAM20_SHIFT            (20U)
/*! SRAM20 - RAM Partition 20 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM20(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM20_SHIFT)) & PMC_PDCFGSTATUS2_SRAM20_MASK)

#define PMC_PDCFGSTATUS2_SRAM21_MASK             (0x200000U)
#define PMC_PDCFGSTATUS2_SRAM21_SHIFT            (21U)
/*! SRAM21 - RAM Partition 21 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM21(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM21_SHIFT)) & PMC_PDCFGSTATUS2_SRAM21_MASK)

#define PMC_PDCFGSTATUS2_SRAM22_MASK             (0x400000U)
#define PMC_PDCFGSTATUS2_SRAM22_SHIFT            (22U)
/*! SRAM22 - RAM Partition 22 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM22(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM22_SHIFT)) & PMC_PDCFGSTATUS2_SRAM22_MASK)

#define PMC_PDCFGSTATUS2_SRAM23_MASK             (0x800000U)
#define PMC_PDCFGSTATUS2_SRAM23_SHIFT            (23U)
/*! SRAM23 - RAM Partition 23 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM23(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM23_SHIFT)) & PMC_PDCFGSTATUS2_SRAM23_MASK)

#define PMC_PDCFGSTATUS2_SRAM24_MASK             (0x1000000U)
#define PMC_PDCFGSTATUS2_SRAM24_SHIFT            (24U)
/*! SRAM24 - RAM Partition 24 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM24(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM24_SHIFT)) & PMC_PDCFGSTATUS2_SRAM24_MASK)

#define PMC_PDCFGSTATUS2_SRAM25_MASK             (0x2000000U)
#define PMC_PDCFGSTATUS2_SRAM25_SHIFT            (25U)
/*! SRAM25 - RAM Partition 25 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM25(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM25_SHIFT)) & PMC_PDCFGSTATUS2_SRAM25_MASK)

#define PMC_PDCFGSTATUS2_SRAM26_MASK             (0x4000000U)
#define PMC_PDCFGSTATUS2_SRAM26_SHIFT            (26U)
/*! SRAM26 - RAM Partition 26 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM26(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM26_SHIFT)) & PMC_PDCFGSTATUS2_SRAM26_MASK)

#define PMC_PDCFGSTATUS2_SRAM27_MASK             (0x8000000U)
#define PMC_PDCFGSTATUS2_SRAM27_SHIFT            (27U)
/*! SRAM27 - RAM Partition 27 Array Power Down
 *  0b0..Array was powered on
 *  0b1..Array and periphery were powered down
 */
#define PMC_PDCFGSTATUS2_SRAM27(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDCFGSTATUS2_SRAM27_SHIFT)) & PMC_PDCFGSTATUS2_SRAM27_MASK)

